zupcorp23012025.Расширение1/src/Documents/ЗГ_ВводУдержанийСотрудников/ЗГ_ВводУдержанийСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗГ_ВводУдержанийСотрудников</name>
  <registerRecords>AccumulationRegister.ЗГ_УдержанияСотрудниковОрганизации</registerRecords>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Удержания</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>Уволен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

zupcorp23012025.Расширение1/src/AccumulationRegisters/ЗГ_УдержанияСотрудниковОрганизации/ЗГ_УдержанияСотрудниковОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗГ_УдержанияСотрудниковОрганизации</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

zupcorp23012025.Расширение1/src/InformationRegisters/ВидыЗанятостиСотрудников/ВидыЗанятостиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5b5b91e-1975-41cd-b4d1-c6c19ba8c6f0">
  <name>ВидыЗанятостиСотрудников</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="926fa512-51ea-46cb-ac2c-07058d80ada8">
    <name>ВидЗанятости</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="f069b975-9037-4c96-8ce9-fcaf50df5731">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="9a4fae71-7fda-411b-8e57-8eeab0d3c08c">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

zupcorp23012025.Расширение1/src/Enums/ВидыЗанятости/ВидыЗанятости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7895878e-218b-49f4-9537-c548399b8a7a">
  <name>ВидыЗанятости</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="9ebfad6a-c229-4f18-8506-66574703fd8a">
    <name>ОсновноеМестоРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="de88385b-6628-4244-994c-2910818bcb7a">
    <name>Совместительство</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bb98f298-4fc8-4c27-bf5c-36869f474e74">
    <name>ВнутреннееСовместительство</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

zupcorp23012025.Расширение1/src/Enums/ВидыКадровыхСобытий/ВидыКадровыхСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b2c547fd-343e-4bc1-9763-795b28132ed4">
  <name>ВидыКадровыхСобытий</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="20908286-45be-433e-b33d-fc9b1619f433">
    <name>Увольнение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

zupcorp23012025.Расширение1/src/Documents/ЗГ_ВводУдержанийСотрудников/ManagerModule.bsl
Функция ПолучитьРезультатЗапросаФизическихЛицДляЗаполнения(Подразделение, ПериодРегистрации, Должность = Неопределено) Экспорт 
	
	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ПараметрыПолученияСотрудников.Подразделение 	= Подразделение;
	КонецЕсли;
	ПараметрыПолученияСотрудников.НачалоПериода		= НачалоМесяца(ПериодРегистрации);
	ПараметрыПолученияСотрудников.ОкончаниеПериода  = КонецМесяца(ПериодРегистрации);
	ПараметрыПолученияСотрудников.КадровыеДанные = "Должность, Подразделение, ВидЗанятости";
	
	Отборы = Новый Массив;
	СписокВидовЗанятостей = Новый Массив;
	СписокВидовЗанятостей.Добавить(Перечисления.ВидыЗанятости.ОсновноеМестоРаботы);
	СписокВидовЗанятостей.Добавить(Перечисления.ВидыЗанятости.Совместительство);
	Отборы.Добавить(Новый Структура ("ЛевоеЗначение, ВидСравнения, ПравоеЗначение, ОтносительныйПуть", "ВидЗанятости", "В", СписокВидовЗанятостей, Истина));
	ПараметрыПолученияСотрудников.Отборы = Отборы;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(МенеджерВременныхТаблиц, Истина, ПараметрыПолученияСотрудников, "ВТВсеСотрудникиОрганизации");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 		
	    "ВЫБРАТЬ
	    |	ЗГ_УдержанияСотрудниковОрганизацииОбороты.ФизическоеЛицо КАК ФизическоеЛицо
	    |ПОМЕСТИТЬ ВТ_ФизЛицаИсключения
	    |ИЗ
	    |	РегистрНакопления.ЗГ_УдержанияСотрудниковОрганизации.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ЗГ_УдержанияСотрудниковОрганизацииОбороты
	    |ГДЕ
	    |	ЗГ_УдержанияСотрудниковОрганизацииОбороты.СуммаПриход <> 0
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	Сотрудники.Период КАК Период,
	    |	Сотрудники.Сотрудник КАК Сотрудник,
	    |	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	    |	Сотрудники.Подразделение КАК Подразделение,
	    |	Сотрудники.Должность КАК Должность,
	    |	Сотрудники.ВидЗанятости КАК ВидЗанятости
	    |ПОМЕСТИТЬ ВТ_РаботающиеСотрудники
	    |ИЗ
	    |	ВТВсеСотрудникиОрганизации КАК Сотрудники
	    |ГДЕ
	    |	Сотрудники.ВидЗанятости В (ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы), ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство))
	    |	И ВЫБОР
	    |			КОГДА &ОтбиратьДолжность
	    |				ТОГДА Сотрудники.Должность = &Должность
	    |			ИНАЧЕ ИСТИНА
	    |		КОНЕЦ
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	    |	КадроваяИсторияСотрудниковИнтервальный.ФизическоеЛицо КАК ФизическоеЛицо,
	    |	КадроваяИсторияСотрудниковИнтервальный.Подразделение КАК Подразделение,
	    |	КадроваяИсторияСотрудниковИнтервальный.Должность КАК Должность,
	    |	ВидыЗанятостиСотрудниковСрезПоследних.ВидЗанятости КАК ВидЗанятости
	    |ПОМЕСТИТЬ ВТ_УволенныеСотрудники
	    |ИЗ
	    |	РегистрСведений.КадроваяИсторияСотрудниковИнтервальный КАК КадроваяИсторияСотрудниковИнтервальный
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыЗанятостиСотрудников.СрезПоследних(&КонецПериода, ) КАК ВидыЗанятостиСотрудниковСрезПоследних
	    |		ПО КадроваяИсторияСотрудниковИнтервальный.Сотрудник = ВидыЗанятостиСотрудниковСрезПоследних.Сотрудник
	    |			И КадроваяИсторияСотрудниковИнтервальный.ГоловнаяОрганизация = ВидыЗанятостиСотрудниковСрезПоследних.ГоловнаяОрганизация
	    |			И КадроваяИсторияСотрудниковИнтервальный.ФизическоеЛицо = ВидыЗанятостиСотрудниковСрезПоследних.ФизическоеЛицо
	    |ГДЕ
	    |	НЕ КадроваяИсторияСотрудниковИнтервальный.ФизическоеЛицо В
	    |				(ВЫБРАТЬ
	    |					ВТ_РаботающиеСотрудники.ФизическоеЛицо КАК ФизическоеЛицо
	    |				ИЗ
	    |					ВТ_РаботающиеСотрудники КАК ВТ_РаботающиеСотрудники)
	    |	И ВЫБОР
	    |			КОГДА &ОтбиратьПодразделение
	    |				ТОГДА КадроваяИсторияСотрудниковИнтервальный.Подразделение = &Подразделение
	    |			ИНАЧЕ ИСТИНА
	    |		КОНЕЦ
	    |	И КадроваяИсторияСотрудниковИнтервальный.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
	    |	И НАЧАЛОПЕРИОДА(КадроваяИсторияСотрудниковИнтервальный.ДатаНачала, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
	    |	И ВЫБОР
	    |			КОГДА &ОтбиратьДолжность
	    |				ТОГДА КадроваяИсторияСотрудниковИнтервальный.Должность = &Должность
	    |			ИНАЧЕ ИСТИНА
	    |		КОНЕЦ
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	    |	ВТ_РаботающиеСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	    |	ВТ_РаботающиеСотрудники.Подразделение КАК Подразделение,
	    |	ВТ_РаботающиеСотрудники.Должность КАК Должность,
	    |	ЛОЖЬ КАК Уволен
	    |ИЗ
	    |	ВТ_РаботающиеСотрудники КАК ВТ_РаботающиеСотрудники
	    |ГДЕ
	    |	НЕ ВТ_РаботающиеСотрудники.ФизическоеЛицо В
	    |				(ВЫБРАТЬ
	    |					ВТ_ФизЛицаИсключения.ФизическоеЛицо КАК ФизическоеЛицо
	    |				ИЗ
	    |					ВТ_ФизЛицаИсключения КАК ВТ_ФизЛицаИсключения)
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ РАЗЛИЧНЫЕ
	    |	ВТ_УволенныеСотрудники.ФизическоеЛицо,
	    |	ВТ_УволенныеСотрудники.Подразделение,
	    |	ВТ_УволенныеСотрудники.Должность,
	    |	ИСТИНА
	    |ИЗ
	    |	ВТ_УволенныеСотрудники КАК ВТ_УволенныеСотрудники
	    |ГДЕ
	    |	ВТ_УволенныеСотрудники.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы)
	    |	И НЕ ВТ_УволенныеСотрудники.ФизическоеЛицо В
	    |				(ВЫБРАТЬ
	    |					ВТ_ФизЛицаИсключения.ФизическоеЛицо КАК ФизическоеЛицо
	    |				ИЗ
	    |					ВТ_ФизЛицаИсключения КАК ВТ_ФизЛицаИсключения)";
		
	Запрос.УстановитьПараметр("ОтбиратьПодразделение", ЗначениеЗаполнено(Подразделение));
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ОтбиратьДолжность", ЗначениеЗаполнено(Должность));
	Запрос.УстановитьПараметр("Должность", Должность);
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодРегистрации));
	
	Результат = Запрос.Выполнить(); 
	
	Возврат Результат;
	
КонецФункции
